app/controllers/academic_records_controller.rb

SELECT * FROM `academic_records` WHERE (`academic_records`.`id` = 1)
---
  def show
    @academic_record = AcademicRecord.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `academic_records` WHERE (`academic_records`.`user_id` = 1) LIMIT 1
---
  def edit
    current_user.role.name == "admin" ? @id = params[:id] : @id = current_user.id
    @user = User.find(@id)
    @user = current_user
    @academic_record = AcademicRecord.find_by_user_id(current_user.id)

INSERT INTO `academic_records` (`student_id`, `p_college`, `pcollege_start`, `created_at`, `gpa`, `gpa_range`, `updated_at`, `college`, `major`, `college_start`, `pcollege_end`, `college_end`, `college_level`) VALUES(NULL, '', '', '2009-01-01 01:17:31', '3.6', '4.0', '2009-01-01 01:17:31', 'UCF', 'Biomedical Science', '02/04', '', '04/08', 'freshman')
INSERT INTO `transcripts` (`size`, `created_at`, `content_type`, `thumbnail`, `updated_at`, `user_id`, `parent_id`, `height`, `filename`, `width`) VALUES(49190, '2009-01-01 04:16:05', 'application/pdf', NULL, '2009-01-01 04:16:05', NULL, NULL, NULL, 'transcript.pdf', NULL)
---
  def create
    @academic_record = AcademicRecord.new(params[:academic_record]) || AcademicRecord.new
    @academic_record.user_id = current_user.id
    if params[:transcript_file] != ""
      Transcript.transaction do
        current_user.transcript.destroy if current_user.transcript
        current_user.transcript = Transcript.new( :uploaded_data => params[:transcript_file] )
        current_user.transcript.save

SELECT * FROM `academic_records` WHERE (`academic_records`.`user_id` = 1) LIMIT 1
DELETE FROM `transcripts` WHERE `id` = 1
INSERT INTO `transcripts` (`size`, `created_at`, `content_type`, `thumbnail`, `updated_at`, `user_id`, `parent_id`, `height`, `filename`, `width`) VALUES(49190, '2009-01-01 06:10:25', 'application/pdf', NULL, '2009-01-01 06:10:25', 1, NULL, NULL, 'transcript.pdf', NULL)
UPDATE `academic_records` SET `updated_at` = '2009-01-01 04:25:09', `college_level` = 'senior' WHERE `id` = 1
---
  def update
    @academic_record = AcademicRecord.find_by_user_id(current_user.id)
    if params[:transcript_file] && params[:transcript_file] != ""
      current_user.transcript.destroy if current_user.transcript
      current_user.transcript = Transcript.new(:uploaded_data => params[:transcript_file])
      current_user.transcript.save