app/controllers/academic_records_controller.rb

  def index
    if current_user.role.name == "admin"
      @user = User.find(params[:id]) if params[:id]
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def new
    current_user.role.name == "admin" ? @id = params[:id] : @id = current_user.id
    @user = User.find(@id)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
    current_user.role.name == "admin" ? @id = params[:id] : @id = current_user.id
    @user = User.find(@id)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def update
    current_user.role.name == "admin" ? @id = params[:id] : @id = current_user.id
    @user = User.find(@id)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1