app/controllers/projects_controller.rb

SELECT * FROM `projects`
---
  def index
    @projects_2008 = Project.all :conditions => [ "year = ?", 2008 ]