app/controllers/recommendations_controller.rb

  def show
    @recommendation = Recommendation.find(params[:id])
---
SELECT * FROM `recommendations` WHERE (`recommendations`.`id` = 0)