app/controllers/students_controller.rb

SELECT * FROM `students` WHERE (`students`.`token` = '86ac8b41dac99a921fb4902ae061f38efbb2e589') LIMIT 1
---
  def edit
    @student = Student.find_by_token(params[:id])

INSERT INTO `students` (`city`, `dob`, `zip`, `created_at`, `ethnicity`, `pstate`, `token`, `updated_at`, `middlename`, `citizenship`, `lastname`, `street`, `cresidence`, `gender`, `firstname`, `phone`, `pzip`, `disability`, `pcity`, `state`, `pstreet`, `pphone`, `email`, `race`) VALUES('San Diego', '1970-12-31 00:00:00', '92122-4915', '2008-12-31 23:57:46', 'Prefer not to respond', '', 'ac7bd6f6fb8aa7853f4063532c344136ae80809d', '2008-12-31 23:57:46', 'James', 'United States', 'Grevich ', '7150 Shoreline Drive, Unit #3311', '', 'Prefer not to respond', 'Justin', '(612) 747-0895', '', '', '', 'CA', '', '', 'jgrevich@gmail.com', 'Prefer not to respond')
---
  def create
    @student = Student.new(params[:student])
    respond_to do |format|
      if @student.save_with_captcha