app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.login = @user.email
    success = @user && @user.save
    if success && @user.errors.empty?
---
INSERT INTO `users` (`city`, `salt`, `dob`, `zip`, `created_at`, `ethnicity`, `remember_token_expires_at`, `crypted_password`, `pstate`, `token`, `updated_at`, `middlename`, `citizenship`, `lastname`, `street`, `cresidence`, `gender`, `firstname`, `phone`, `remember_token`, `pzip`, `disability`, `login`, `pcity`, `email`, `state`, `pstreet`, `pphone`, `race`) VALUES('San Diego', '806068cf51e1e74187e06292ff24c328b542471c', '1970-01-01 00:00:00', '92122-4915', '2009-01-01 02:31:11', NULL, NULL, '74df42f5bebc9bd96afc78536964d1517f8eb880', '', NULL, '2009-01-01 02:31:11', 'James', 'United States', 'Grevich', '7150 Shoreline Drive, Unit #3311', NULL, NULL, 'Justin', '(612) 747-0895', NULL, '', NULL, 'jgrevich@gmail.com', '', 'jgrevich@gmail.com', 'CA', '', '', NULL)
SELECT `users`.id FROM `users` WHERE (`users`.`login` = BINARY '') LIMIT 1

  def edit
    if current_user && current_user.submitted_at && !is_admin
      flash[:notice] = 'You application has already be submitted.'
      redirect_to( :controller => "users", :action => "status" )
    else
      current_user.role.name == "admin" ? @id = params[:id] : @id = current_user.id
      @user = User.find(@id)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def update
    current_user.role.name == "admin" ? @id = params[:id] : @id = current_user.id
    @user = User.find(@id)
    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-01-01 04:11:19', `pstate` = 'MN', `pphone` = '612.747.0895', `pstreet` = '2782 Parkview Drive', `pzip` = '55340', `pcity` = 'Medina' WHERE `id` = 1